#coding=utf-8
import re

##	-------------------------------------------------------------------------------------
##	精确查找一个单词。\b means word boundary, basically. Can be space, punctuation, etc
##	-------------------------------------------------------------------------------------
def find_word(text, search):
	result = re.findall('\\b'+search+'\\b', text, flags=re.IGNORECASE)
	#result = re.findall(r'\b' + search + r'\b', text, flags=re.IGNORECASE)
	if len(result)>0:
		return 1
	else:
		return 0

def find_declare(line_content):
	singal_name	= "";

	##	-------------------------------------------------------------------------------------
	##	声明的关键字列表
	##	-------------------------------------------------------------------------------------
	key_word_list	= ["parameter","localparam","function","task","input","output","inout","wire","reg"];

	##	-------------------------------------------------------------------------------------
	##	行头第一个字符作为关键字
	##	-------------------------------------------------------------------------------------
	key_word	= line_content.split(' ')[0];

	##	-------------------------------------------------------------------------------------
	##	去掉关键字
	##	-------------------------------------------------------------------------------------
	line_value	= line_content.split(' ');
	del line_value[0];

	##	-------------------------------------------------------------------------------------
	##	如果定义了位宽，则删掉位宽
	##	-------------------------------------------------------------------------------------
	try:
	    index_value = line_content.index("]")
	except ValueError:
	    index_value = -1
	if(index_value!=-1):
		line_value	= line_content[index_value:len(line_content)];

	##	-------------------------------------------------------------------------------------
	##	提取信号名称
	##	tab 转换为空格
	##	去掉行首行尾的空格符
	##	-------------------------------------------------------------------------------------
	line_value	= ' '.join(line_value);
	line_value	= line_value.replace("\t"," ");
	line_value	= line_value.strip();
	singal_name	= line_value.split(' ')[0];

	##	-------------------------------------------------------------------------------------
	##	在关键字列表中循环查找
	##	-------------------------------------------------------------------------------------
	for i in range(0,len(key_word_list)):
		if(key_word==key_word_list[i]):
			return	singal_name

	return ""
